_test-results/2/webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-max-vus-100.txt
-o csv=webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-max-vus-100.gz --tag profile=webmvc-jdbc-tomcat-ramping-arrival-rate-stress-max-vus-100 --tag threads=16

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: script-ramping-arrival-rate-stress.js
     output: Prometheus remote write (https://prometheus.catbro.keenetic.pro/api/v1/write), csv (webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-max-vus-100.gz)

  scenarios: (100.00%) 1 scenario, 100 max VUs, 14m30s max duration (incl. graceful stop):
           * petclinic: Up to 500.00 iterations/s for 14m0s over 34 stages (maxVUs: 10-100, gracefulStop: 30s)

WARN[0363] Request Failed                                error="Post \"https://springpetclinicrest.ru/api/owners\": read tcp 10.166.0.54:48950->34.110.223.40:443: read: connection reset by peer"
ERRO[0363] GoError: the body is null so we can't transform it to JSON - this likely was because of a request error getting the response
running at reflect.methodValueCall (native)
petcliniat file:///home/kotoant/dev/git/spring-petclinic-rest/script-ramping-arrival-rate-stress.js:192:20(63)  executor=ramping-arrival-rate scenario=petclinic source=stacktrace
WARN[0402] Insufficient VUs, reached 100 active VUs and cannot initialize more  executor=ramping-arrival-rate scenario=petclinic

     ✗ post owner status was 201
      ↳  99% — ✓ 275429 / ✗ 1
     ✓ post pet status was 201
     ✓ post visit status was 201
     ✓ get owner status was 200
     ✓ get pet status was 200
     ✓ get visit status was 200
     ✓ find owners status was 200
     ✓ put pet status was 200
     ✓ put visit status was 200
     ✓ put owner status was 200

     checks.........................: 99.99%  ✓ 2754290     ✗ 1      
     data_received..................: 883 MB  1.1 MB/s
     data_sent......................: 436 MB  519 kB/s
     dropped_iterations.............: 25669   30.558293/s
     http_req_blocked...............: avg=860ns    min=159ns   med=403ns    max=48.54ms p(90)=506ns    p(95)=547ns   
     http_req_connecting............: avg=27ns     min=0s      med=0s       max=5.46ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=16.98ms  min=515.5µs med=5.72ms   max=1.08s   p(90)=43.62ms  p(95)=58.58ms 
       { expected_response:true }...: avg=16.98ms  min=2.54ms  med=5.72ms   max=1.08s   p(90)=43.62ms  p(95)=58.58ms 
     http_req_failed................: 0.00%   ✓ 1           ✗ 2754290
     http_req_receiving.............: avg=137.06µs min=0s      med=51.61µs  max=59.79ms p(90)=223.69µs p(95)=380.74µs
     http_req_sending...............: avg=48.12µs  min=15.15µs med=41.14µs  max=25.43ms p(90)=62.16µs  p(95)=73.95µs 
     http_req_tls_handshaking.......: avg=338ns    min=0s      med=0s       max=26.41ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=16.79ms  min=0s      med=5.56ms   max=1.08s   p(90)=43.45ms  p(95)=58.33ms 
     http_reqs......................: 2754291 3278.913531/s
     iteration_duration.............: avg=171.53ms min=1.3ms   med=184.41ms max=1.32s   p(90)=313.44ms p(95)=347.81ms
     iterations.....................: 275430  327.892424/s
     vus............................: 0       min=0         max=100  
     vus_max........................: 100     min=10        max=100  


running (14m00.0s), 000/100 VUs, 275430 complete and 0 interrupted iterations
petclinic ✓ [======================================] 000/100 VUs  14m0s  003.54 iters/s