_test-results/2/webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress.txt
     ✗ post owner status was 201
      ↳  99% — ✓ 265912 / ✗ 165
     ✗ post pet status was 201
      ↳  99% — ✓ 265776 / ✗ 136
     ✗ post visit status was 201
      ↳  99% — ✓ 265616 / ✗ 160
     ✗ get owner status was 200
      ↳  99% — ✓ 265442 / ✗ 174
     ✗ get pet status was 200
      ↳  99% — ✓ 265468 / ✗ 148
     ✗ get visit status was 200
      ↳  99% — ✓ 265452 / ✗ 164
     ✗ find owners status was 200
      ↳  99% — ✓ 265466 / ✗ 150
     ✗ put pet status was 200
      ↳  99% — ✓ 265463 / ✗ 153
     ✗ put visit status was 200
      ↳  99% — ✓ 265476 / ✗ 140
     ✗ put owner status was 200
      ↳  99% — ✓ 265481 / ✗ 135

     checks.........................: 99.94%  ✓ 2655552     ✗ 1525   
     data_received..................: 861 MB  1.0 MB/s
     data_sent......................: 421 MB  501 kB/s
     dropped_iterations.............: 35023   41.69129/s
     http_req_blocked...............: avg=11.48µs  min=149ns   med=397ns   max=269.16ms p(90)=501ns    p(95)=543ns   
     http_req_connecting............: avg=1.26µs   min=0s      med=0s      max=43.94ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=167.03ms min=2.5ms   med=5.92ms  max=2.39s    p(90)=533.05ms p(95)=780.84ms
       { expected_response:true }...: avg=165.97ms min=2.5ms   med=5.91ms  max=2.34s    p(90)=532.88ms p(95)=779.87ms
     http_req_failed................: 0.05%   ✓ 1525        ✗ 2655552
     http_req_receiving.............: avg=291.35µs min=0s      med=55.7µs  max=589.65ms p(90)=326.23µs p(95)=896.59µs
     http_req_sending...............: avg=57.26µs  min=14.54µs med=42.64µs max=431.86ms p(90)=66.72µs  p(95)=83.23µs 
     http_req_tls_handshaking.......: avg=9.53µs   min=0s      med=0s      max=266.8ms  p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=166.68ms min=0s      med=5.73ms  max=2.39s    p(90)=532.74ms p(95)=780.53ms
     http_reqs......................: 2657077 3162.977705/s
     iteration_duration.............: avg=1.66s    min=37.19ms med=1.86s   max=8.35s    p(90)=3.55s    p(95)=4.04s   
     iterations.....................: 266077  316.737384/s
     vus............................: 0       min=0         max=1000 
     vus_max........................: 1000    min=10        max=1000 


running (14m00.1s), 0000/1000 VUs, 266077 complete and 0 interrupted iterations
petclinic ✓ [======================================] 0000/1000 VUs  14m0s  003.54 iters/s